/*Создайте класс IntSet для выполнения операций с множеством целых чисел. 
Реализовать операции добавления элемента, удаление элемента, проверку вхождения элемента, 
объединения множеств и вычитания одного множества из другого*/


/* -Оставить в классе одно множество
 - Сделать деструктор
 - Сделать ввод элементов множества с клавиатуры */

#include <iostream>
#include "l12sets.h"
using namespace std;

int main(){
    IntSet set1, set2;

    int num;
    cout<<"Enter number: ";
    cin>>num;

    
    return 0;
}